<!DOCTYPE html><html lang="en"><head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <meta name="mobile-web-app-capable" content="yes">

    <link rel="icon" type="image/png" href="/favicon.ico"> 
    <title>
        Deep Work
    </title>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha256-916EbMg70RQy9LHiGkXzG8hSg9EdNy97GazNG/aiY1w=" crossorigin="anonymous"> 
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" integrity="sha256-eZrrJcwDc/3uDhsdt61sL2oOBY362qM3lon1gyExkL0=" crossorigin="anonymous">   
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.5.1/themes/prism.min.css" integrity="sha256-vtR0hSWRc3Tb26iuN2oZHt3KRUomwTufNIf5/4oeCyg=" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.7.0/styles/github-gist.min.css" integrity="sha256-tAflq+ymku3Khs+I/WcAneIlafYgDiOQ9stIHH985Wo=" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/emojify.js/1.1.0/css/basic/emojify.min.css" integrity="sha256-UOrvMOsSDSrW6szVLe8ZDZezBxh5IoIfgTwdNDgTjiU=" crossorigin="anonymous"> 
    <link rel="stylesheet" href="/assets/css/main.css">
    <link rel="stylesheet" href="/assets/css/google-fonts.css">
</head>

<body>
       <div class="path-browser container-fluid"><a href="/">Home</a> / <a href="/Reading">Reading</a> / Deep-Work</div>
    <div id="doc" class="markdown-body container-fluid">
        <p>&#x4E9A;&#x9A6C;&#x900A;&#x6EE1;99&#x5143;&#x8D5A;&#x7684;&#x4E66;&#xFF0C;&#x4ECA;&#x5929;&#x5230;&#x8D27;&#x82B1;&#x4E86;&#x5927;&#x6982;&#x56DB;&#x4E2A;&#x5C0F;&#x65F6;&#x901A;&#x8BFB;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x89C9;&#x7684;&#x6709;&#x4E0D;&#x5C11;&#x6536;&#x83B7;&#xFF0C;&#x662F;&#x4E2A;&#x4EBA;&#x5F53;&#x524D;&#x6240;&#x9700;&#x8981;&#x7684;&#x3002;&#x5168;&#x4E66;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7406;&#x8BBA;&#xFF1A;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x4EF7;&#x503C;&#x3001;&#x610F;&#x4E49;</li>
<li class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x51C6;&#x5219;&#xFF1A;&#x8FDB;&#x884C;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x4E9B;&#x51C6;&#x5219;</li>
</ul>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x53EA;&#x8BB0;&#x4E0B;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x4E00;&#x662F;&#x901A;&#x8FC7;&#x603B;&#x7ED3;&#x52A0;&#x6DF1;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x4E8C;&#x662F;&#x4EE5;&#x5907;&#x4EE5;&#x540E;&#x4E0D;&#x65F6;&#x4E4B;&#x9700;&#x3002;&#x6CE8;&#x610F;&#xFF1A;</p>
<ol>
<li class="raw">&#x4E66;&#x4E2D;&#x6709;&#x5927;&#x91CF;&#x4E30;&#x5BCC;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x4F8B;&#xFF0C;&#x8FD9;&#x91CC;&#x90FD;&#x7565;&#x6389;&#x4E86;&#x3002;</li>
<li class="raw">&#x6709;&#x4E9B;&#x611F;&#x60F3;&#x7C7B;&#x6BD4;&#x662F;&#x4E2A;&#x4EBA;&#x6240;&#x5199;&#xFF08;&#x5927;&#x90FD;&#x5728;&#x4EE5;&#x62EC;&#x53F7;&#x6807;&#x51FA;&#xFF09;</li>
</ol>
<h2 class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7406;&#x8BBA;</h2>
<h3 class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x4E0E;&#x6D6E;&#x6D45;&#x5DE5;&#x4F5C;</h3>
<p>&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x7279;&#x70B9;&#xFF1A;</p>
<ol>
<li class="raw">&#x65E0;&#x5E72;&#x6270;</li>
<li class="raw">&#x4F7F;&#x4E2A;&#x4EBA;&#x8BA4;&#x77E5;&#x80FD;&#x529B;&#x8FBE;&#x5230;&#x6781;&#x9650;</li>
<li class="raw">&#x521B;&#x9020;&#x65B0;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x63D0;&#x5347;&#x6280;&#x80FD;</li>
<li class="raw">&#x96BE;&#x4EE5;&#x590D;&#x5236;</li>
</ol>
<p>&#x6D6E;&#x6D45;&#x5DE5;&#x4F5C;&#x7684;&#x7279;&#x70B9;&#xFF1A;</p>
<ol>
<li class="raw">&#x5F80;&#x5F80;&#x6709;&#x5E72;&#x6270;</li>
<li class="raw">&#x5BF9;&#x8BA4;&#x8BC6;&#x80FD;&#x529B;&#x8981;&#x6C42;&#x4E0D;&#x9AD8;</li>
<li class="raw">&#x6CA1;&#x4EC0;&#x4E48;&#x4EF7;&#x503C;</li>
<li class="raw">&#x5BB9;&#x6613;&#x590D;&#x5236;</li>
</ol>
<blockquote class="raw">
<p>&#x5728;&#x6781;&#x5EA6;&#x6D6E;&#x6D45;&#x7684;&#x72B6;&#x6001;&#x4E0B;&#x5EA6;&#x8FC7;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5C06;&#x6C38;&#x4E45;&#x6027;&#x7684;&#x964D;&#x4F4E;&#x81EA;&#x5DF1;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x80FD;&#x529B;</p>
</blockquote>
<h3 class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x4EF7;&#x503C;</h3>
<ol>
<li class="raw">&#x4FE1;&#x606F;&#x65F6;&#x4EE3;&#x6280;&#x672F;&#x66F4;&#x65B0;&#x5F88;&#x5FEB; &#x27A1; &#x9700;&#x8981;&#x5FEB;&#x901F;&#x5B66;&#x4E60;&#x590D;&#x6742;&#x6280;&#x80FD; &#x27A1; &#x9700;&#x8981;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;</li>
<li class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x521B;&#x9020;&#x7684;&#x4EF7;&#x503C;  &#x27A1; &#x53D7;&#x4F17;&#x53EF;&#x80FD;&#x662F;&#x65E0;&#x9650;&#x7684;  &#x27A1; &#x6781;&#x5927;&#x7684;&#x63D0;&#x5347;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x5956;&#x52B1;</li>
</ol>
<blockquote class="raw">
<p>&#x7CBE;&#x5FC3;&#x6311;&#x9009;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#xFF08;&#x5207;&#x6362;&#x9898;&#x6750;&#x4ECE;&#x800C;&#x4FDD;&#x6301;&#x65B0;&#x9C9C;&#x611F;&#xFF1F;&#x6CE8;&#x610F;&#x529B;&#x6B8B;&#x7559;&#xFF1F;&#xFF09;&#xFF0C;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x7684;&#x6D6E;&#x6D45;&#x5DE5;&#x4F5C;&#x5219;&#x62C6;&#x5206;&#x6210;&#x5C0F;&#x5757;&#xFF0C;&#x5728;&#x65E5;&#x7A0B;&#x7684;&#x95F4;&#x9699;&#x5B8C;&#x6210;&#xFF08;&#x788E;&#x7247;&#x5316; vs. &#x96C6;&#x4E2D;&#x5316; &#xFF1F;&#xFF09;</p>
</blockquote>
<h3 class="raw">&#x4E09;&#x7C7B;&#x4EBA;</h3>
<p>&#x6570;&#x5B57;&#x79D1;&#x6280;&#xFF08;&#x667A;&#x80FD;&#x673A;&#x5668;&#xFF09;&#x7684;&#x53D1;&#x5C55;&#x5206;&#x5316;&#x4E86;&#x52B3;&#x52A8;&#x529B;&#x5E02;&#x573A;&#xFF08;&#x6570;&#x5B57;&#x9E3F;&#x6C9F;&#xFF09;&#xFF0C;&#x7B5B;&#x9009;&#x51FA;&#x4E86;&#x4E09;&#x7C7B;&#x83B7;&#x76CA;&#x4EBA;&#xFF1A;</p>
<ol>
<li class="raw">&#x9AD8;&#x7EA7;&#x6280;&#x672F;&#x5DE5;&#x4EBA;&#xFF1A;&#x64C5;&#x957F;&#x4F7F;&#x7528;&#x667A;&#x80FD;&#x673A;&#x5668;&#x8FDB;&#x884C;&#x521B;&#x9020;&#x6027;&#x5DE5;&#x4F5C;</li>
<li class="raw">&#x8D85;&#x7EA7;&#x660E;&#x661F;&#xFF1A;&#x884C;&#x4E1A;&#x7FD8;&#x695A;&#xFF0C;&#x80DC;&#x8005;&#x901A;&#x5403;&#xFF08;&#x56E0;&#x4E3A;&#x8FDC;&#x7A0B;&#x534F;&#x4F5C;&#xFF0C;&#x4FE1;&#x606F;&#x6D41;&#x901A;&#x7B49;&#x6280;&#x672F;&#xFF09;</li>
<li class="raw">&#x6240;&#x6709;&#x8005;&#xFF1A;&#x5373;&#x6240;&#x8C13;&#x7684;&#x8D44;&#x672C;&#x5BB6;&#xFF0C;&#x56E0;&#x4E3A;&#x52B3;&#x52A8;&#x529B;&#x9650;&#x5236;&#x5F97;&#x5230;&#x5927;&#x4E3A;&#x964D;&#x4F4E;</li>
</ol>
<p><mark>&#x5B66;&#x4E60;&#x590D;&#x6742;&#x6280;&#x80FD;(&#x4E0D;&#x53EF;&#x590D;&#x5236;&#xFF09;&#xFF0C;&#x5C06;&#x6280;&#x80FD;&#x63A8;&#x5411;&#x6781;&#x9650;&#x6765;&#x521B;&#x9020;&#x5B9E;&#x5728;&#x7684;&#x4EF7;&#x503C;&#x3001;&#x6210;&#x679C;</mark></p>
<h3 class="raw">&#x57F9;&#x517B;&#x548C;&#x6DF1;&#x5316;&#x81EA;&#x5DF1;&#x7684;&#x5934;&#x8111;</h3>
<p>&#x6DF1;&#x5EA6;&#x4E13;&#x6CE8;&#x3001;&#x523B;&#x610F;&#x5B66;&#x4E60;(deliberate practice)</p>
<ul>
<li class="raw">&#x6CE8;&#x610F;&#x529B;&#x5168;&#x60C5;&#x6295;&#x5165; &#xFF08;&#x9700;&#x8981;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#xFF09;</li>
<li class="raw">&#x9002;&#x65F6;&#x5F97;&#x5230;&#x53CD;&#x9988;&#xFF0C;&#x4ECE;&#x800C;&#x8C03;&#x6574;&#x65B9;&#x6CD5;</li>
</ul>
<blockquote class="raw">
<p>&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x4E00;&#x9879;&#x7279;&#x5B9A;&#x6280;&#x80FD;&#xFF0C;&#x53CD;&#x590D;&#x5229;&#x7528;&#x540C;&#x4E00;&#x5927;&#x8111;&#x56DE;&#x8DEF;&#xFF0C;&#x80FD;&#x6709;&#x6548;&#x7684;&#x56FA;&#x5316;&#x8FD9;&#x9879;&#x6280;&#x80FD; (&#x795E;&#x7ECF;&#x53CD;&#x5C04;&#xFF0C;&#x719F;&#x80FD;&#x751F;&#x5DE7;)</p>
</blockquote>
<ul>
<li class="raw">&#x9AD8;&#x8D28;&#x91CF;&#x4EA7;&#x751F; &#xFF1D; &#x65F6;&#x95F4; x &#x4E13;&#x6CE8;&#x5EA6;</li>
<li class="raw">&#x6CE8;&#x610F;&#x529B;&#x6B8B;&#x7559;&#xFF1A;&#x591A;&#x4EFB;&#x52A1;&#x5E76;&#x884C;&#x6548;&#x7387;&#x4F4E;&#x4E8E;&#x6309;&#x6B21;&#x5E8F;&#x5B8C;&#x6210;&#x591A;&#x9879;&#x4EFB;&#x52A1; &#xFF08;&#x53C2;&#x8003;js&#x5355;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x524D;&#x597D;&#x50CF;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x8BB2;&#x8FD9;&#x4E2A;&#xFF09;</li>
</ul>
<p><mark>&#x957F;&#x65F6;&#x95F4;&#x3001;&#x65E0;&#x5E72;&#x6270;&#x3001;&#x9AD8;&#x5EA6;&#x4E13;&#x6CE8;&#x4E8E;&#x5355;&#x4E00;&#x4EFB;&#x52A1;</mark></p>
<h3 class="raw">&#x6CE8;&#x610F;&#x529B;&#x7BA1;&#x7406;</h3>
<ol>
<li class="raw">&#x96C6;&#x4E2D;&#x6CE8;&#x610F;&#x529B; vs. &#x5206;&#x6563;&#x6CE8;&#x610F;&#x529B;</li>
<li class="raw">&#x8D1F;&#x9762;&#x6050;&#x60E7;&#x3001;&#x9057;&#x61BE; vs. &#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x7F8E;&#x597D;&#x4E8B;&#x7269;&#xFF0C;&#x5FFD;&#x7565;&#x8D1F;&#x9762;&#x4FE1;&#x606F;  &#xFF08;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#xFF09;</li>
</ol>
<blockquote class="raw">
<p>&#x6E38;&#x624B;&#x597D;&#x95F2;&#x662F;&#x4E07;&#x6076;&#x4E4B;&#x6E90;&#x3002;&#x5F53;&#x4F60;&#x5931;&#x53BB;&#x5173;&#x6CE8;&#x70B9;&#x65F6;&#xFF0C;&#x5934;&#x8111;&#x4E0D;&#x4F1A;&#x60F3;&#x7740;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x597D;&#x4E8B;&#xFF0C;&#x800C;&#x4F1A;&#x7EA0;&#x7F20;&#x4E8E;&#x751F;&#x6D3B;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;</p>
</blockquote>
<blockquote class="raw">
<p>&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x8EAB;&#x4F53;&#x6216;&#x5927;&#x8111;&#x5728;&#x81EA;&#x89C9;&#x52AA;&#x529B;&#x5B8C;&#x6210;&#x67D0;&#x9879;&#x8270;&#x96BE;&#x4E14;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FBE;&#x5230;&#x6781;&#x9650;&#x65F6;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x6700;&#x4F18;&#x4F53;&#x9A8C;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;</p>
</blockquote>
<p>&#x5DE5;&#x4F5C;&#x5176;&#x5B9E;&#x6BD4;&#x4F11;&#x95F2;&#x65F6;&#x5149;&#x66F4;&#x5BB9;&#x6613;&#x5E26;&#x6765;&#x4EAB;&#x53D7;&#xFF0C;&#x5934;&#x8111;&#x559C;&#x6B22;&#x6311;&#x6218;<br>
&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x5E26;&#x6765;&#x7684;&#x5FC3;&#x6D41;&#x7ECF;&#x5386;&#x53EF;&#x4EE5;&#x4E3A;&#x4F60;&#x5E26;&#x6765;&#x6DF1;&#x5EA6;&#x7684;&#x6EE1;&#x8DB3;&#x611F;</p>
<h3 class="raw">&#x4ECE;&#x54F2;&#x5B66;&#x4E0A;&#x770B;</h3>
<p>&#x5BF9;&#x5DE5;&#x4F5C;&#x6709;&#x67D0;&#x79CD;&#x795E;&#x5723;&#x611F;&#xFF08;&#x6240;&#x8C13;&#x7684;&#x5320;&#x5FC3;&#xFF1F;&#xFF09;&#xFF0C;&#x8BA4;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x5DE5;&#x4F5C;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x80FD;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5F97;&#x5230;&#x6EE1;&#x8DB3;&#x611F;&#xFF0C;&#x4ECE;&#x800C;&#x4EA7;&#x751F;&#x6B63;&#x53CD;&#x9988;&#x7684;&#x6FC0;&#x52B1;&#x4F5C;&#x7528;&#x3002;</p>
<h2 class="raw">&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x51C6;&#x5219;</h2>
<h3 class="raw">&#x51C6;&#x5219;1&#xFF1A;&#x5DE5;&#x4F5C;&#x8981;&#x6DF1;&#x5165; &#xFF08;&#x57F9;&#x517B;&#x5DE5;&#x4F5C;&#x7684;&#x4E60;&#x60EF;&#xFF09;</h3>
<blockquote class="raw">
<p>&#x6B32;&#x671B;&#x662F;&#x5E38;&#x6001;&#xFF0C;&#x800C;&#x975E;&#x4E2A;&#x4F8B;</p>
</blockquote>
<p>&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E2D;&#x8BF1;&#x60D1;&#x662F;&#x5F88;&#x591A;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x9AD8;&#x4F30;&#x81EA;&#x5DF1;&#x7684;&#x62B5;&#x6297;&#x529B;&#x3002;&#x610F;&#x5FD7;&#x529B;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x6BCF;&#x6B21;&#x62B5;&#x6297;&#x90FD;&#x4F1A;&#x6709;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x8D8A;&#x8FC7;&#x826F;&#x597D;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E2D;&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x7279;&#x522B;&#x8BBE;&#x8BA1;&#x7684;&#x60EF;&#x4F8B;&#x548C;&#x56FA;&#x5B9A;&#x7A0B;&#x5E8F;&#x3002;&#x4EE5;&#x4E0B;&#x6709;6&#x79CD;&#x7B56;&#x7565;&#xFF1A;</p>
<ol>
<li class="raw">&#x9996;&#x5148;&#x8981;&#x9009;&#x5B9A;&#x4F60;&#x7684;&#x6DF1;&#x5EA6;&#x54F2;&#x5B66;&#xFF1A;
<ul>
<li class="raw">&#x7981;&#x6B32; &#xFF08;&#x82E6;&#x4FEE;&#x5F0F;&#xFF09;</li>
<li class="raw">&#x53CC;&#x5CF0; (&#x4F8B;&#x5982;&#x6BCF;&#x5E74;&#x4E00;&#x4E2A;&#x6708;&#x201D;&#x9690;&#x5C45;&#x201C;&#xFF0C;&#x5176;&#x5B83;&#x65F6;&#x95F4;&#x6B63;&#x5E38;)</li>
<li class="raw">&#x8282;&#x594F;&#xFF1A;&#x6309;&#x8BA1;&#x5212;&#x6BCF;&#x5929;&#x7279;&#x5B9A;&#x65F6;&#x5019;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;</li>
<li class="raw">&#x65B0;&#x95FB;&#x8BB0;&#x8005;&#xFF1A;&#x7531;&#x4E8E;&#x5DE5;&#x4F5C;&#x7684;&#x7279;&#x6B8A;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x968F;&#x65F6;&#x968F;&#x5730;&#x8FDB;&#x5165;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;</li>
</ul>
</li>
<li class="raw">&#x4E60;&#x60EF;&#x5316;&#xFF1A;&#x5C06;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x4E60;&#x60EF;&#x5316;&#xFF08;&#x5177;&#x4F53;&#x7684;&#x4E60;&#x60EF;&#x8981;&#x770B;&#x4E2A;&#x4EBA;&#x662F;&#x5426;&#x5408;&#x9002;&#xFF09;</li>
<li class="raw">&#x8981;&#x6709;&#x5927;&#x624B;&#x7B14;&#xFF1A;&#x9002;&#x5F53;&#x52A0;&#x5927;&#x7CBE;&#x529B;&#x3001;&#x91D1;&#x94B1;&#x7684;&#x6295;&#x5165;&#x6765;&#x521B;&#x9020;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x826F;&#x597D;&#x73AF;&#x5883;&#xFF08;&#x5305;&#x62EC;&#x7269;&#x7406;&#x548C;&#x5FC3;&#x7406;&#xFF09;</li>
<li class="raw">&#x4E0D;&#x8981;&#x72EC;&#x81EA;&#x5DE5;&#x4F5C;&#xFF1A;&#x6070;&#x5F53;&#x7684;&#x52A0;&#x5165;&#x534F;&#x4F5C;</li>
<li class="raw">&#x50CF;&#x7ECF;&#x5546;&#x4E00;&#x6837;&#x6267;&#x884C;
<ul>
<li class="raw">&#x5173;&#x6CE8;&#x70B9;&#x653E;&#x5230;&#x6781;&#x7AEF;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x4E0A; &#xFF08;&#x4F60;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8D8A;&#x591A;&#xFF0C;&#x5B8C;&#x6210;&#x7684;&#x4E8B;&#x60C5;&#x8D8A;&#x5C11;&#xFF09;</li>
<li class="raw">&#x6293;&#x4FE1;&#x5F15;&#x9886;&#x6027;&#x6307;&#x6807; &#xFF08;&#x53CA;&#x65F6;&#x53CD;&#x9988;&#xFF0C;&#x5982;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#xFF09;</li>
<li class="raw">&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x9192;&#x76EE;&#x7684;&#x8BB0;&#x5206;&#x677F; &#xFF08;&#x8BB0;&#x5F55;&#xFF0C;&#x63D0;&#x9192;&#xFF0C;&#x516C;&#x5F00;&#x5316;&#x6765;&#x5F97;&#x5230;&#x52A8;&#x529B;&#xFF09;</li>
<li class="raw">&#x5B9A;&#x671F;&#x95EE;&#x8D23; &#xFF08;&#x53CD;&#x9988;&#xFF0C;&#x8C03;&#x6574;&#xFF09;</li>
</ul>
</li>
<li class="raw">&#x56FE;&#x5B89;&#x9038;&#xFF1A; &#x52B3;&#x9038;&#x7ED3;&#x5408;</li>
</ol>
<h3 class="raw">&#x51C6;&#x5219;2&#xFF1A;&#x62E5;&#x62B1;&#x65E0;&#x804A;</h3>
<blockquote class="raw">
<p>&#x4E00;&#x65E6;&#x4F60;&#x9002;&#x5E94;&#x4E86;&#x5206;&#x5FC3;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x8FF7;&#x604B;&#x4E8E;&#x6B64;</p>
</blockquote>
<p>&#x7B56;&#x7565;&#xFF1A;&#x9884;&#x5148;&#x8BA1;&#x5212;&#x597D;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#xFF0C;&#x5728;&#x5176;&#x5B83;&#x65F6;&#x95F4;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;<br>
<mark>&#x4F7F;&#x7528;&#x4EE4;&#x4EBA;&#x5206;&#x5FC5;&#x7684;&#x7F51;&#x7EDC;&#x672C;&#x8EAB;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x51CF;&#x5C11;&#x4F60;&#x5927;&#x8111;&#x4E13;&#x6CE8;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x51CF;&#x635F;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x7684;&#x884C;&#x4E3A;&#x662F;&#xFF0C;&#x7A0D;&#x6709;&#x65E0;&#x804A;&#x6216;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#x8BA4;&#x77E5;&#x4E0A;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5C31;&#x4ECE;&#x4F4E;&#x523A;&#x6FC0;&#x3001;&#x9AD8;&#x4EF7;&#x503C;&#x7684;&#x6D3B;&#x52A8;&#x8F6C;&#x5411;&#x9AD8;&#x523A;&#x6FC0;&#x3001;&#x4F4E;&#x4EF7;&#x503C;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x5927;&#x8111;&#x4E0D;&#x80FD;&#x5BB9;&#x5FCD;&#x6CA1;&#x6709;&#x65B0;&#x5947;&#x6027;&#x7684;&#x4E1C;&#x897F;</mark> &#xFF08;&#x597D;&#x50CF;&#x4E5F;&#x662F;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x770B;&#x5230;&#x8FC7;&#xFF1F;&#xFF09;</p>
<p>&#x901A;&#x8FC7;&#x5206;&#x5272;&#x7F51;&#x7EDC;&#xFF08;&#x76F8;&#x5F53;&#x4E8E;&#x5206;&#x5272;&#x4E86;&#x5206;&#x5FC3;&#xFF09;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x81EA;&#x5DF1;&#x5206;&#x5FC3;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x589E;&#x5F3A;&#x4E86;&#x81EA;&#x5DF1;&#x63A7;&#x5236;&#x6CE8;&#x610F;&#x529B;&#x7684;&#x529B;&#x91CF;&#x3002;<br>
&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li class="raw">&#x5373;&#x4F7F;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#xFF0C;&#x8BE5;&#x7B56;&#x7565;&#x4E5F;&#x9002;&#x7528;</li>
<li class="raw">&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x5F7B;&#x5E95;&#x5730;&#x5C4F;&#x85E9;&#x7F51;&#x7EDC;</li>
<li class="raw">&#x5728;&#x5DE5;&#x4F5C;&#x5916;&#x4E5F;&#x6309;&#x8BA1;&#x5212;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x4E13;&#x6CE8;&#x8BAD;&#x7EC3;&#x7684;&#x6548;&#x679C;</li>
</ul>
<h3 class="raw">&#x51C6;&#x5219;3&#xFF1A;&#x8FDC;&#x79BB;&#x793E;&#x4EA4;&#x5A92;&#x4F53;</h3>
<blockquote class="raw">
<p>&#x660E;&#x786E;&#x5728;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x548C;&#x4E2A;&#x4EBA;&#x751F;&#x6D3B;&#x4E2D;&#x51B3;&#x5B9A;&#x6210;&#x529F;&#x4E0E;&#x5E78;&#x798F;&#x7684;&#x6838;&#x5FC3;&#x56E0;&#x7D20;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x5DE5;&#x5177;&#x5BF9;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x7684;&#x5B9E;&#x9645;&#x76CA;&#x5904;&#x5927;&#x4E8E;&#x5B9E;&#x9645;&#x5BB3;&#x5904;&#x65F6;&#x624D;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
</blockquote>
<blockquote class="raw">
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x62B5;&#x5FA1;&#x5A31;&#x4E50;&#x7F51;&#x7AD9;&#x5BF9;&#x4F60;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x7684;&#x8BF1;&#x60D1;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7ED9;&#x5927;&#x8111;&#x627E;&#x4E00;&#x4E9B;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x66FF;&#x4EE3;&#x6D3B;&#x52A8;</p>
</blockquote>
<h3 class="raw">&#x51C6;&#x5219;4&#xFF1A;&#x6452;&#x5F03;&#x6D6E;&#x6D45;</h3>
<p>&#x51CF;&#x5C11;&#x6D6E;&#x6D45;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4FDD;&#x6301;&#x6DF1;&#x5EA6;&#x5DE5;&#x4F5C;&#x3002; &#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x51CF;&#x5C11;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x7387;&#x589E;&#x52A0;&#x4E86;&#x3002;<br>
&#x4E00;&#x5929;&#x7684;&#x6BCF;&#x4E00;&#x5206;&#x949F;&#x90FD;&#x8981;&#x505A;&#x597D;&#x8BA1;&#x5212;&#xFF08;&#x592A;&#x4E25;&#x683C;&#x4E86;&#x5427;&#xFF1F;&#xFF09;&#xFF0C;&#x5B9A;&#x91CF;&#x5206;&#x6790;&#x6BCF;&#x4E00;&#x9879;&#x6D3B;&#x52A8;&#x7684;&#x6DF1;&#x5EA6; &#xFF08;&#x5408;&#x7406;&#x7684;&#x89C4;&#x5212;&#xFF09;</p>
<p>update: 2017-08-24</p>

    </div>
    <div class="ui-toc dropup unselectable hidden-print" style="display:none;">
        <div class="pull-right dropdown">
            <a id="tocLabel" class="ui-toc-label btn btn-default" data-toggle="dropdown" href="#" role="button" aria-haspopup="true" aria-expanded="false" title="Table of content">
                <i class="fa fa-bars"></i>
            </a>
            <ul id="ui-toc" class="ui-toc-dropdown dropdown-menu" aria-labelledby="tocLabel">
                
            </ul>
        </div>
    </div>
    <div id="ui-toc-affix" class="ui-affix-toc ui-toc-dropdown unselectable hidden-print" data-spy="affix" style="top:17px;display:none;">
        
    </div>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.1.1/jquery.min.js" integrity="sha256-hVVnYaiADRTO2PzUGmuLJr8BLUSjGIZsDYGmIJLv2b8=" crossorigin="anonymous"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha256-U5ZEeKfGNOja007MMD3YBI0A3OSZOQbeG6z2f2Y0hu8=" crossorigin="anonymous" defer></script>
      
    <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML"></script>
    </body></html>