<!DOCTYPE html><html lang="en"><head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <meta name="mobile-web-app-capable" content="yes">

    <link rel="icon" type="image/png" href="/favicon.ico"> 
    <title>
        Mood
    </title>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha256-916EbMg70RQy9LHiGkXzG8hSg9EdNy97GazNG/aiY1w=" crossorigin="anonymous"> 
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" integrity="sha256-eZrrJcwDc/3uDhsdt61sL2oOBY362qM3lon1gyExkL0=" crossorigin="anonymous">   
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.5.1/themes/prism.min.css" integrity="sha256-vtR0hSWRc3Tb26iuN2oZHt3KRUomwTufNIf5/4oeCyg=" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.7.0/styles/github-gist.min.css" integrity="sha256-tAflq+ymku3Khs+I/WcAneIlafYgDiOQ9stIHH985Wo=" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/emojify.js/1.1.0/css/basic/emojify.min.css" integrity="sha256-UOrvMOsSDSrW6szVLe8ZDZezBxh5IoIfgTwdNDgTjiU=" crossorigin="anonymous"> 
    <link rel="stylesheet" href="/assets/css/main.css">
    <link rel="stylesheet" href="/assets/css/google-fonts.css">
</head>

<body>
       <div class="path-browser container-fluid"><a href="/">Home</a> / <a href="/English">English</a> / Mood</div>
    <div id="doc" class="markdown-body container-fluid">
        <h1 class="raw">&#x8BED;&#x6C14;&#xFF08;Moods&#xFF09;</h1>
<p>&#x8BED;&#x6C14;&#x662F;&#x5229;&#x7528;&#x52A8;&#x8BCD;&#x53D8;&#x5316;&#x6765;&#x8868;&#x8FBE;&#x201C;&#x771F;&#x3001;&#x5047;&#x201D;&#x53E3;&#x543B;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4F9D;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7A0B;&#x5EA6;&#x7684;&#x201C;&#x771F;&#x3001;&#x5047;&#x201D;&#x53E3;&#x543B;&#xFF0C;&#x53EF;&#x4EE5;&#x7EC6;&#x5206;&#x4E3A;&#x56DB;&#x79CD;&#x8BED;&#x6C14;&#xFF1A;</p>
<ul>
<li class="raw">&#x53D9;&#x8FF0;&#x4E8B;&#x5B9E;&#x8BED;&#x6C14;&#xFF08;Indicative&#xFF09;&#xFF1A;&#x8868;&#x793A;&#x6240;&#x8BF4;&#x7684;&#x662F;&#x771F;&#x7684;</li>
<li class="raw">&#x6761;&#x4EF6;&#x8BED;&#x6C14;&#xFF08;Conditional&#xFF09;&#xFF1A;&#x8868;&#x793A;&#x771F;&#x5047;&#x8FD8;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;</li>
<li class="raw">&#x5047;&#x8BBE;&#x8BED;&#x6C14;&#xFF08;Subjunctive&#xFF09;&#xFF1A;&#x8BF4;&#x53CD;&#x8BDD;&#xFF0C;&#x8868;&#x793A;&#x6240;&#x8BF4;&#x7684;&#x4E0E;&#x4E8B;&#x5B9E;&#x76F8;&#x53CD;</li>
<li class="raw">&#x7948;&#x4F7F;&#x8BED;&#x6C14;&#xFF08;Imperative&#xFF09;&#xFF1A;&#x8868;&#x793A;&#x5E0C;&#x671B;&#x80FD;&#x6210;&#x771F;&#xFF0C;&#x4F46;&#x5C1A;&#x672A;&#x5B9E;&#x73B0;</li>
</ul>
<h2 class="raw">&#x53D9;&#x8FF0;&#x4E8B;&#x5B9E;&#x8BED;&#x6C14;</h2>
<p>&#x4E00;&#x822C;&#x7684;&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x8BED;&#x6C14;&#xFF0C;&#x5728;&#x65F6;&#x6001;&#x90E8;&#x5206;&#x6240;&#x5B66;&#x7684;&#x73B0;&#x5728;&#x5F0F;&#x3001;&#x8FC7;&#x53BB;&#x5F0F;&#x3001;&#x672A;&#x6765;&#x5F0F;&#x7B49;&#x7B49;&#x4E5F;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;&#x53D9;&#x8FF0;&#x4E8B;&#x5B9E;&#x8BED;&#x6C14;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x5FC5;&#x591A;&#x4F5C;&#x89E3;&#x91CA;&#x3002;&#x5176;&#x4E2D;&#x53EA;&#x6709;&#x672A;&#x6765;&#x5F0F;&#x8981;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ol>
<li class="raw">I&#x2019;ll go to the U.S. next year to study for an MBA degree.<br>
&#x73B0;&#x5728;&#x3001;&#x8FC7;&#x53BB;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x771F;&#x5047;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x53D9;&#x8FF0;&#x4E8B;&#x5B9E;&#x8BED;&#x6C14;&#x3002;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#x8FD8;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#xFF0C;&#x4E25;&#x683C;&#x8BF4;&#x8D77;&#x6765;&#x8FD8;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x771F;&#x5047;&#xFF0C;&#x6240;&#x4EE5;&#x672A;&#x6765;&#x5F0F;&#x4E2D;&#x52A8;&#x8BCD;&#x8981;&#x52A0;&#x4E0A;&#x52A9;&#x52A8;&#x8BCD; will, &#x56E0;&#x4E3A;&#x52A9;&#x52A8;&#x8BCD;&#x90FD;&#x5E26;&#x6709;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x8BED;&#x6C14;&#x3002;</li>
<li class="raw">The weatherman says sunrise tomorrow is at 5:32.<br>
The movie starts in 5 minutes.<br>
&#x867D;&#x7136;&#x8FD8;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x4E8B;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x201C;&#x786E;&#x5B9A;&#x7684;&#x4E8B;&#x5B9E;&#x201D;&#xFF0C;&#x4E0D;&#x5FC5;&#x52A0;&#x4E0A;&#x8868;&#x793A;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x52A9;&#x52A8;&#x8BCD;&#x3002;</li>
<li class="raw">I&#x2019;ll be ready when he comes.<br>
If you are late again, you&#x2019;ll be fired.<br>
&#x540C;&#x65F6;&#x53D9;&#x8FF0;&#x4E24;&#x4EF6;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x6027;&#xFF0C;&#x800C;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x6709;&#x65F6;&#x95F4;&#x6216;&#x6761;&#x4EF6;&#x7684;&#x5173;&#x8054;&#x6027;&#x65F6;&#xFF0C;&#x5F80;&#x5F80;&#x5176;&#x4E2D;&#x4E00;&#x4EF6;&#xFF08;&#x526F;&#x8BCD;&#x4ECE;&#x53E5;&#x4E2D;&#x7684;&#x90A3;&#x53E5;&#xFF09;&#x8981;&#x6539;&#x6210;&#x73B0;&#x5728;&#x5F0F;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4E24;&#x4EF6;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x4E0D;&#x786E;&#x5B9A;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x5047;&#x5B9A;&#x5176;&#x4E2D;&#x4E00;&#x4EF6;&#x662F;&#x4E8B;&#x5B9E;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#xFF0C;&#x624D;&#x80FD;&#x53BB;&#x63A8;&#x8BBA;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;</li>
</ol>
<h2 class="raw">&#x6761;&#x4EF6;&#x8BED;&#x6C14;</h2>
<p>&#x53E5;&#x5B50;&#x4E2D;&#x4E00;&#x65E6;&#x52A0;&#x4E0A;&#x8BED;&#x6C14;&#x52A9;&#x52A8;&#x8BCD;&#xFF08;&#x5982; must, should, will/would, may/might, can/could &#x7B49;&#xFF09;&#xFF0C;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x8BED;&#x6C14;&#xFF0C;&#x79F0;&#x4E3A;&#x6761;&#x4EF6;&#x8BED;&#x6C14;&#x3002;&#x6709;&#x4E24;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<ol>
<li class="raw">&#x8868;&#x8FBE;&#x65F6;&#x95F4;&#x529F;&#x80FD;&#x7684;&#x4E0D;&#x5B8C;&#x6574;&#x6027;<br>
&#x8BED;&#x6C14;&#x52A9;&#x52A8;&#x8BCD;&#x4E2D;&#xFF0C;must &#x548C; should &#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x5728;&#x62FC;&#x6CD5;&#x4E0A;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#x3002;&#x81F3;&#x4E8E; will/would, may/might, can/could &#x8FD9;&#x4E09;&#x5BF9;&#x867D;&#x7136;&#x62FC;&#x6CD5;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x53EF;&#x662F;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x8BED;&#x6C14;&#x7684;&#x53D8;&#x5316;&#xFF1A;&#x6BCF;&#x4E00;&#x5BF9;&#x7684;&#x540E;&#x8005;&#x6BD4;&#x524D;&#x8005;&#x66F4;&#x4E0D;&#x786E;&#x5B9A;&#x3002;<br>
&#x8BED;&#x6C14;&#x52A9;&#x52A8;&#x8BCD;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;must&#x8FD9;&#x4E00;&#x7C7B;&#xFF0C;&#x8FD8;&#x662F;can/could&#x8FD9;&#x4E00;&#x7C7B;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x660E;&#x786E;&#x8868;&#x8FBE;&#x8FC7;&#x53BB;&#x5F0F;&#x3002;&#x52A9;&#x52A8;&#x8BCD;&#x540E;&#x9762;&#x8981;&#x7528;&#x52A8;&#x8BCD;&#x539F;&#x5F62;&#xFF0C;&#x540C;&#x6837;&#x7F3A;&#x4E4F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x8BED;&#x6C14;&#x52A9;&#x52A8;&#x8BCD;&#x9700;&#x8981;&#x5BFB;&#x627E;&#x53E6;&#x4E00;&#x79CD;&#x7279;&#x522B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x8FC7;&#x53BB;&#x65F6;&#x95F4;&#x3002;</li>
<li class="raw">&#x7528;&#x5B8C;&#x6210;&#x5F0F;&#x8868;&#x8FBE;&#x5BF9;&#x8FC7;&#x53BB;&#x7684;&#x731C;&#x6D4B;<br>
&#x8BED;&#x6C14;&#x52A9;&#x52A8;&#x8BCD;&#x7528;&#x6765;&#x731C;&#x6D4B;&#x8FC7;&#x53BB;&#x7684;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x7F3A;&#x4E4F;&#x8868;&#x8FBE;&#x8FC7;&#x53BB;&#x65F6;&#x95F4;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x501F;&#x52A9;&#x5B8C;&#x6210;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x3002;&#x4F8B;&#x5982;&#xFF1A;<br>
It may rain any minute now.  (&#x5BF9;&#x73B0;&#x5728;&#x3001;&#x672A;&#x6765;&#x7684;&#x731C;&#x6D4B;)<br>
It may have rained a little last night. &#xFF08;&#x5BF9;&#x8FC7;&#x53BB;&#x7684;&#x731C;&#x6D4B;&#xFF09;</li>
</ol>
<h2 class="raw">&#x5047;&#x8BBE;&#x8BED;&#x6C14;</h2>
<p>&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x8BF4;&#x53CD;&#x8BDD;&#x201D;&#x7684;&#x8BED;&#x6C14;&#xFF0C;&#x8868;&#x793A;&#x6240;&#x8BF4;&#x7684;&#x8BDD;&#x548C;&#x4E8B;&#x5B9E;&#x76F8;&#x53CD;&#x3002;&#x8FD9;&#x79CD;&#x8BED;&#x6C14;&#x662F;&#x4EE5;&#x52A8;&#x8BCD;&#x7684;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x4F5C;&#x4E3A;&#x8868;&#x8FBE;&#x201C;&#x975E;&#x4E8B;&#x5B9E;&#x201D;&#x7684;&#x624B;&#x6BB5;&#x3002;</p>
<ol>
<li class="raw">&#x73B0;&#x5728;&#x65F6;&#x95F4;<br>
If I were you, I wouldn&#x2019;t do it. &#x5047;&#x8BBE;&#x8BED;&#x6C14;&#x662F;&#x7528;&#x52A8;&#x8BCD;&#x7684;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x6765;&#x8868;&#x793A;&#x201D;&#x975E;&#x4E8B;&#x5B9E;&#x201C;&#xFF0C;&#x56E0;&#x6B64;&#x7528; I were you &#x6765;&#x8868;&#x793A;&#x3002;&#x8FDE;&#x5E26;&#x5728;&#x4E3B;&#x53E5;&#x4E2D;&#x4E5F;&#x7528;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#xFF08;&#x4E0D;&#x4EE3;&#x8868;&#x8FC7;&#x53BB;&#x65F6;&#x95F4;&#xFF09;&#x7684; would &#x6765;&#x8868;&#x793A;&#x975E;&#x4E8B;&#x5B9E;&#x3002;</li>
<li class="raw">&#x8FC7;&#x53BB;&#x65F6;&#x95F4;<br>
If I had known earlier, I might have done something.<br>
&#x53E5;&#x5B50;&#x63CF;&#x8FF0;&#x7684;&#x65F6;&#x95F4;&#x672C;&#x6765;&#x5C31;&#x662F;&#x8FC7;&#x53BB;&#x65F6;&#x95F4;&#xFF0C;&#x8981;&#x7528;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x6765;&#x8868;&#x793A;&#x201D;&#x975E;&#x4E8B;&#x5B9E;&#x201C;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x7528;&#x8FC7;&#x53BB;&#x5B8C;&#x6210;&#x5F62;&#x6001; had known. &#x540C;&#x6837;&#xFF0C;&#x4E3B;&#x53E5;&#x4E2D;&#x4E5F;&#x8981;&#x7528;&#x8FC7;&#x53BB;&#x5B8C;&#x6210;&#x5F62;&#x6001;&#xFF08;&#x6CE8;&#x610F;&#x533A;&#x5206;&#x8FC7;&#x53BB;&#x5B8C;&#x6210;&#x65F6;&#xFF09; might have done. &#x5176;&#x4E2D; might &#x662F;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#xFF0C; have done &#x662F;&#x5B8C;&#x6210;&#x5F0F;&#x3002;</li>
<li class="raw">&#x672A;&#x6765;&#x65F6;&#x95F4;<br>
If an asteroid should hit the earth, man could die out.<br>
&#x8FD9;&#x662F;&#x672A;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E25;&#x683C;&#x8BF4;&#x8D77;&#x6765;&#x8FD8;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x751F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x751A;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7528;&#x975E;&#x4E8B;&#x5B9E;&#x8BED;&#x6C14;&#x6765;&#x53D9;&#x8FF0;&#x3002;&#x6761;&#x4EF6;&#x4ECE;&#x53E5;&#x4E2D;&#x7528;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x4F46;&#x4E0D;&#x4EE3;&#x8868;&#x8FC7;&#x53BB;&#x5F0F;&#x7684; should hit &#x6765;&#x8868;&#x793A;&#x975E;&#x4E8B;&#x5B9E;&#xFF0C;&#x4E3B;&#x53E5;&#x4E2D;&#x4E5F;&#x662F;&#x7528; could die &#x6765;&#x8868;&#x793A;&#x975E;&#x4E8B;&#x5B9E;&#x3002;<br>
&#x5982;&#x679C;&#x662F;&#x7EDD;&#x65E0;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF1A;<br>
If I were to take the bribe, I could never look at other people in the eye again. &#x7528; be going to &#x7684;&#x8FC7;&#x53BB;&#x5F62;&#x6001; were to &#x6765;&#x8868;&#x793A;&#x672A;&#x6765;&#x4E5F;&#x7EDD;&#x4E0D;&#x4F1A;&#x53BB;&#x505A;&#x3002; &#x5982;&#x679C;&#x7528;&#x7684;&#x662F; should&#xFF0C; &#x8BED;&#x6C14;&#x5C31;&#x6BD4;&#x8F83;&#x677E;&#x52A8;&#xFF0C;&#x8868;&#x793A;&#x5E94;&#x65E0;&#x53D1;&#x751F;&#x7684;&#x53EF;&#x80FD;&#x4F46;&#x4E0D;&#x6392;&#x9664;&#x4E07;&#x4E00;&#x3002;</li>
</ol>
<p>&#x4EE5;&#x4E0A;&#x4E09;&#x79CD;&#x65F6;&#x95F4;&#x7684;&#x9E21;&#x7A9D;&#xFF0C;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x503C;&#x5F97;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ol>
<li class="raw">&#x53E5;&#x578B;&#x7684;&#x89C4;&#x5F8B;&#x6027;<br>
&#x56E0;&#x4E3A;&#x5047;&#x8BBE;&#x8BED;&#x6C14;&#x7684;&#x53E5;&#x5B50;&#x662F;&#x7528;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x6765;&#x8868;&#x793A;&#x975E;&#x4E8B;&#x5B9E;&#xFF0C;&#x6240;&#x4EE5;&#x52A8;&#x8BCD;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x3002;&#x4ECE;&#x4EE5;&#x4E0A;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E3B;&#x53E5;&#x4E2D;&#x90FD;&#x6709;&#x8FC7;&#x53BB;&#x5F0F;&#x7684;&#x8BED;&#x6C14;&#x52A9;&#x8BCD;&#xFF08;would, might, could). &#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x53E5;&#x5B50;&#x90FD;&#x662F;&#x5728;&#x8868;&#x8FBE;&#x5728;&#x4E00;&#x4E2A;&#x5047;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#xFF08;&#x975E;&#x4E8B;&#x5B9E;&#xFF09;&#x4E0B;&#x201C;&#x5C31;&#x4F1A;&#x201D;&#x3001;&#x201C;&#x5C31;&#x53EF;&#x80FD;&#x201D;&#x3001;&#x201C;&#x5C31;&#x80FD;&#x201C;&#x6709;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#xFF08;&#x4E5F;&#x662F;&#x975E;&#x4E8B;&#x5B9E;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5047;&#x8BBE;&#x8BED;&#x6C14;&#x7684;&#x4E3B;&#x53E5;&#x4E2D;&#x90FD;&#x4F1A;&#x6709;&#x8FC7;&#x53BB;&#x62FC;&#x6CD5;&#x7684;&#x52A9;&#x52A8;&#x8BCD;&#x5B58;&#x5728;&#x3002;<br>
&#x5728;&#x5047;&#x8BBE;&#x8BED;&#x6C14;&#x7684;&#x6761;&#x4EF6;&#x4ECE;&#x53E5;&#x4E2D;&#xFF0C;&#x8868;&#x793A;&#x73B0;&#x5728;&#x65F6;&#x95F4;&#x548C;&#x8FC7;&#x53BB;&#x65F6;&#x95F4;&#x7684;&#x90FD;&#x6CA1;&#x6709;&#x52A9;&#x52A8;&#x8BCD;&#x5B58;&#x5728;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8981;&#x5148;&#x628A;&#x5047;&#x8BBE;&#x7684;&#x6761;&#x4EF6;&#x5F53;&#x771F;&#xFF0C;&#x4E0D;&#x80FD;&#x7528;&#x8868;&#x793A;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x52A9;&#x52A8;&#x8BCD;&#x3002;&#x53EA;&#x6709;&#x672A;&#x6765;&#x65F6;&#x95F4;&#x65E0;&#x6CD5;&#x6392;&#x9664;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x7528; should &#x6765;&#x8868;&#x793A;&#x53EF;&#x80FD;&#x6027;&#x6781;&#x5C0F;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7EDD;&#x65E0;&#x53EF;&#x80FD;&#x7684;&#x72B6;&#x51B5;&#x7528; were to &#x6765;&#x8868;&#x793A;&#x3002;&#x8FD9;&#x662F;&#x6761;&#x4EF6;&#x4ECE;&#x53E5;&#x4E2D;&#x552F;&#x4E00;&#x4F1A;&#x89C1;&#x5230;&#x52A9;&#x52A8;&#x8BCD;&#x7684;&#x5730;&#x65B9;&#x3002;</li>
<li class="raw">&#x52A8;&#x8BCD;&#x7684;&#x89C4;&#x5F8B;&#x6027;<br>
&#x5047;&#x8BBE;&#x8BED;&#x6C14;&#x7684;&#x52A8;&#x8BCD;&#x90FD;&#x662F;&#x4EE5;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#x6765;&#x8868;&#x793A;&#x975E;&#x4E8B;&#x5B9E;&#xFF0C;&#x82E5;&#x662F;&#x73B0;&#x5728;&#x65F6;&#x95F4;&#x5C31;&#x9000;&#x540E;&#x6210;&#x8FC7;&#x53BB;&#x5F62;&#x6001;&#xFF0C;&#x8FC7;&#x53BB;&#x65F6;&#x95F4;&#x4E5F;&#x5C31;&#x9000;&#x540E;&#x6210;&#x4E3A;&#x8FC7;&#x53BB;&#x5B8C;&#x6210;&#x5F62;&#x6001;&#xFF0C;&#x800C;&#x672A;&#x6765;&#x65F6;&#x95F4;&#x5219;&#x662F;&#x4E3B;&#x4ECE;&#x53E5;&#x90FD;&#x7528;&#x8FC7;&#x53BB;&#x62FC;&#x6CD5;&#x7684;&#x52A9;&#x52A8;&#x8BCD;&#x6765;&#x8868;&#x793A;&#x3002;</li>
<li class="raw">&#x6DF7;&#x5408;&#x65F6;&#x95F4;&#x7684;&#x53D8;&#x5316;<br>
If I had studied harder in school, I could qualify for the job now.</li>
<li class="raw">&#x6DF7;&#x5408;&#x771F;&#x5047;&#x7684;&#x53D8;&#x5316;<br>
I could have contributed to the fund dirve then, only that I didn&#x2019;t have any money with me.</li>
<li class="raw">&#x53E5;&#x578B;&#x7684;&#x53D8;&#x5316;<br>
&#x5047;&#x8BBE;&#x8BED;&#x6C14;&#x7684;&#x53E5;&#x578B;&#x5F88;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x89C4;&#x89C4;&#x77E9;&#x77E9;&#x7684;&#x201C;&#x6761;&#x4EF6;&#x4ECE;&#x53E5;&#xFF0B;&#x4E3B;&#x53E5;&#x201D;&#x7684;&#x5F62;&#x6001;&#x3002;&#x4F8B;&#x5982;&#xFF1A;<br>
It&#x2019;s time kids were in bed.<br>
If only I had more time!</li>
</ol>
<h2 class="raw">&#x7948;&#x4F7F;&#x8BED;&#x6C14;</h2>
<p>&#x7948;&#x4F7F;&#x8BED;&#x6C14;&#x53EF;&#x89C6;&#x4E3A;&#x662F;&#x6761;&#x4EF6;&#x8BED;&#x6C14;&#x4E2D;&#xFF0C;&#x7701;&#x7565;&#x52A9;&#x52A8;&#x8BCD;&#x6765;&#x8868;&#x793A;&#x201C;&#x5E0C;&#x671B;&#x80FD;&#x6210;&#x771F;&#xFF0C;&#x4F46;&#x5C1A;&#x672A;&#x5B9E;&#x73B0;&#x201D;&#x3002;&#x4F8B;&#x5982;&#xFF1A; Come in! &#x53EF;&#x89C6;&#x4E3A; You may come in! &#x7684;&#x7701;&#x7565;&#x3002;<br>
&#x4E00;&#x822C;&#x8BED;&#x6CD5;&#x4E66;&#x4E0A;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#xFF1A;<br>
It is necessary that&#x2026;<br>
I insist that&#x2026;<br>
&#x8FD9;&#x4E9B;&#x53E5;&#x578B;&#x540E;&#x9762;&#x8981;&#x7528;&#x539F;&#x5F62;&#x52A8;&#x8BCD;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x547D;&#x4EE4;&#x53E5;&#xFF0C;&#x6240;&#x4EE5;&#x628A;&#x5B83;&#x79F0;&#x4E3A;&#x201C;&#x95F4;&#x63A5;&#x547D;&#x4EE4;&#x53E5;&#x201D;&#xFF0C;&#x653E;&#x5728;&#x7948;&#x4F7F;&#x8BED;&#x6C14;&#x4E2D;&#x6765;&#x4ECB;&#x7ECD;&#x3002;</p>

    </div>
    <div class="ui-toc dropup unselectable hidden-print" style="display:none;">
        <div class="pull-right dropdown">
            <a id="tocLabel" class="ui-toc-label btn btn-default" data-toggle="dropdown" href="#" role="button" aria-haspopup="true" aria-expanded="false" title="Table of content">
                <i class="fa fa-bars"></i>
            </a>
            <ul id="ui-toc" class="ui-toc-dropdown dropdown-menu" aria-labelledby="tocLabel">
                
            </ul>
        </div>
    </div>
    <div id="ui-toc-affix" class="ui-affix-toc ui-toc-dropdown unselectable hidden-print" data-spy="affix" style="top:17px;display:none;">
        
    </div>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.1.1/jquery.min.js" integrity="sha256-hVVnYaiADRTO2PzUGmuLJr8BLUSjGIZsDYGmIJLv2b8=" crossorigin="anonymous"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha256-U5ZEeKfGNOja007MMD3YBI0A3OSZOQbeG6z2f2Y0hu8=" crossorigin="anonymous" defer></script>
      
    <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML"></script>
    </body></html>