<!DOCTYPE html><html lang="en"><head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <meta name="mobile-web-app-capable" content="yes">

    <link rel="icon" type="image/png" href="/favicon.ico"> 
    <title>
        Words and Phrases
    </title>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha256-916EbMg70RQy9LHiGkXzG8hSg9EdNy97GazNG/aiY1w=" crossorigin="anonymous"> 
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" integrity="sha256-eZrrJcwDc/3uDhsdt61sL2oOBY362qM3lon1gyExkL0=" crossorigin="anonymous">   
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.5.1/themes/prism.min.css" integrity="sha256-vtR0hSWRc3Tb26iuN2oZHt3KRUomwTufNIf5/4oeCyg=" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.7.0/styles/github-gist.min.css" integrity="sha256-tAflq+ymku3Khs+I/WcAneIlafYgDiOQ9stIHH985Wo=" crossorigin="anonymous">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/emojify.js/1.1.0/css/basic/emojify.min.css" integrity="sha256-UOrvMOsSDSrW6szVLe8ZDZezBxh5IoIfgTwdNDgTjiU=" crossorigin="anonymous"> 
    <link rel="stylesheet" href="/assets/css/main.css">
    <link rel="stylesheet" href="/assets/css/google-fonts.css">
</head>

<body>
       <div class="path-browser container-fluid"><a href="/">Home</a> / <a href="/English">English</a> / Words-and-Phrases</div>
    <div id="doc" class="markdown-body container-fluid">
        <h1 class="raw">&#x8BCD;&#x6C47;&#x4E0E;&#x77ED;&#x8BED;&#x7B14;&#x8BB0;</h1>
<ol>
<li class="raw">in the wake of &#x201C;&#x5728;&#x2026;&#x4E4B;&#x540E;&#xFF0C;&#x7D27;&#x8DDF;&#x201D;</li>
<li class="raw">all in all &#x201C;&#x603B;&#x4E4B;&#x201D;</li>
<li class="raw">&#x201C;Not choice, but habit rules the unreflecting herd.&#x201D; William Wordsworth said in the 19th century.<br>
1&#xFF09;unreflecting &#x610F;&#x4E3A;&#x201C;&#x7F3A;&#x4E4F;&#x601D;&#x8003;&#x7684;&#x201D;&#x3002;2) herd &#x5E38;&#x89C1;&#x610F;&#x601D;&#x662F;&#x201C;&#x755C;&#x7FA4;&#xFF0C;&#x7267;&#x7FA4;&#x201D;&#xFF0C;&#x8FD9;&#x91CC;&#x6307;&#x201C;&#x6C11;&#x4F17;&#xFF0C;&#x767E;&#x59D3;&#x201D;&#xFF0C;&#x5E38;&#x542B;&#x8D2C;&#x4E49;&#x3002;</li>
<li class="raw">Among the most popular: paternity and kinship testing. Which adopted children can use to find their biological relatives and families can use to track down kids put up for adoption.<br>
1&#xFF09; track down &#x610F;&#x601D;&#x662F;&#x201C;&#x8DDF;&#x8E2A;&#x627E;&#x5230;&#xFF0C;&#x8FFD;&#x67E5;&#x5230;&#x201D;&#x3002;2) put up for adoption &#x6307;&#x201C;&#x5C06;&#x2026;&#x9001;&#x7ED9;&#x522B;&#x4EBA;&#x6536;&#x517B;&#x201D;&#x3002;</li>
<li class="raw">To take this approach to the New Englanders normally means to start with the Puritan&#x2019;s theological innovations and their distinctive ideas about the church&#x2014;important subjects that we may not neglect.<br>
&#x3010;&#x8BD1;&#x6587;&#x3011;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x770B;&#x5F85;&#x65B0;&#x82F1;&#x683C;&#x5170;&#x4EBA;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x8981;&#x4ECE;&#x8FD9;&#x4E9B;&#x6E05;&#x6559;&#x5F92;&#x7684;&#x795E;&#x5B66;&#x53D8;&#x9769;&#x548C;&#x4ED6;&#x4EEC;&#x5173;&#x4E8E;&#x6559;&#x5802;&#x7684;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x7406;&#x5FF5;&#x5165;&#x624B;&#x2014;&#x2014;&#x8FD9;&#x4E9B;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x5BB9;&#x5FFD;&#x89C6;&#x7684;&#x91CD;&#x8981;&#x4E3B;&#x9898;&#x3002;<br>
&#x3010;&#x70B9;&#x62E8;&#x3011;<br>
&#x52A8;&#x8BCD;&#x77ED;&#x8BED; take a/an &#x2026;approach to sth.&#x610F;&#x601D;&#x662F;&#x201C;&#x5BF9;&#x2026;&#x91C7;&#x7528;&#x2026;&#x65B9;&#x6CD5;/&#x6001;&#x5EA6;&#x201D;&#x3002;</li>
<li class="raw">Copyright rested with the journal publisher, and researchers seeking knowledge of the results would have to subscribe to the journal.<br>
&#x3010;&#x8BD1;&#x6587;&#x3011;&#x8BBA;&#x6587;&#x7684;&#x7248;&#x6743;&#x5F52;&#x6742;&#x5FD7;&#x793E;&#x6240;&#x6709;&#xFF0C;&#x8981;&#x60F3;&#x67E5;&#x9605;&#x6B64;&#x7814;&#x7A76;&#x6210;&#x679C;&#x7684;&#x7814;&#x7A76;&#x8005;&#x5FC5;&#x987B;&#x8BA2;&#x9605;&#x8BE5;&#x6742;&#x5FD7;&#x3002;<br>
&#x3010;&#x70B9;&#x62E8;&#x3011;rest &#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x4F5C;&#x540D;&#x8BCD;&#xFF0C;&#x610F;&#x4E3A;&#x201C;&#x4F11;&#x606F;&#x201D;&#x6216;&#x201C;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x201D;&#x3002;&#x5728;&#x672C;&#x53E5;&#x4E2D;&#xFF0C;rest &#x4E3A;&#x4E0D;&#x53CA;&#x7269;&#x52A8;&#x8BCD;&#xFF0C;&#x610F;&#x4E3A;&#x201C;&#x5F52;&#x4E8E;&#xFF1B;&#x5728;&#x4E8E;&#x201D;&#xFF0C;&#x6B64;&#x65F6;&#x5E38;&#x4E0E; with &#x8FDE;&#x7528;&#x3002;</li>
<li class="raw">The report, by John Houghton of victoria University in Australia and Graham Vickery of the OECO,makes heavy reading for publishers who have, so far, made handsome profits.<br>
&#x3010;&#x8BD1;&#x6587;&#x3011;&#x8FD9;&#x4EFD;&#x6FB3;&#x5927;&#x5229;&#x4E9A;&#x7EF4;&#x591A;&#x5229;&#x4E9A;&#x5927;&#x5B66;&#x7684;&#x7EA6;&#x7FF0;&#xB7;&#x970D;&#x987F;&#x548C;&#x201C;&#x7ECF;&#x5408;&#x7EC4;&#x7EC7;&#x201D;&#x7684;&#x683C;&#x96F7;&#x5384;&#x59C6;&#xB7;&#x7EF4;&#x514B;&#x745E;&#x5171;&#x540C;&#x64B0;&#x5199;&#x7684;&#x62A5;&#x544A;&#x8BA9;&#x90A3;&#x4E9B;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x83B7;&#x53D6;&#x4E86;&#x5DE8;&#x5927;&#x5229;&#x6DA6;&#x7684;&#x51FA;&#x7248;&#x5546;&#x4EEC;&#x8BFB;&#x8D77;&#x6765;&#x5FC3;&#x60C5;&#x6C89;&#x91CD;&#x3002;<br>
&#x3010;&#x70B9;&#x62E8;&#x3011;1&#xFF09; make heavy reading for &#x5728;&#x53E5;&#x4E2D;&#x662F;&#x6307;&#x62A5;&#x544A;&#x8BA9;&#x51FA;&#x7248;&#x5546;&#x4EEC;&#x201C;&#x8BFB;&#x8D77;&#x6765;&#x5FC3;&#x60C5;&#x6C89;&#x91CD;&#x201D;&#x3002;2) handsome &#x539F;&#x610F;&#x4E3A;&#x201C;&#x82F1;&#x4FCA;&#x7684;&#x201D;&#xFF0C;&#x4F46;&#x5728;&#x672C;&#x53E5;&#x4E2D;&#x610F;&#x4E3A;&#x201C;&#xFF08;&#x6536;&#x5165;&#x3001;&#x6536;&#x76CA;&#x7B49;&#xFF09;&#x53EF;&#x89C2;&#x7684;&#xFF0C;&#x4E30;&#x539A;&#x7684;&#x3002;&#x201D;</li>
<li class="raw">by and large &#x610F;&#x4E3A;&#x201C;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF1B;&#x5927;&#x4F53;&#x4E0A;&#x201D;</li>
<li class="raw">Scholars, policymakers, and critics of all stripes have debated the social implications of these changes,but few have looked at the side effect: family risk has risen as well.<br>
&#x3010;&#x8BD1;&#x6587;&#x3011;&#x5B66;&#x8005;&#x3001;&#x653F;&#x7B56;&#x5236;&#x5B9A;&#x8005;&#x4EE5;&#x53CA;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x8BC4;&#x8BBA;&#x5BB6;&#x5C31;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x7684;&#x793E;&#x4F1A;&#x610F;&#x4E49;&#x5C55;&#x5F00;&#x4E86;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x770B;&#x5230;&#x5176;&#x526F;&#x4F5C;&#x7528;&#xFF1B;&#x5BB6;&#x5EAD;&#x98CE;&#x9669;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x3002;</li>
<li class="raw">trade A for B  &#x7528;A&#x4EA4;&#x6362;B</li>
<li class="raw">Left, until now, to odd, low-level IT staff to put right, and seen as a concern only of data-rich industries such as banking, telecoms and air travel, information protection is now high on the boss&#x2019;s agenda in businesses of very variety.<br>
&#x3010;&#x8BD1;&#x6587;&#x3011;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x4FE1;&#x606F;&#x4FDD;&#x62A4;&#x901A;&#x5E38;&#x8FD8;&#x53EA;&#x662F;&#x4E34;&#x65F6;&#x7684;&#x3001;&#x4F4E;&#x5C42;&#x6B21;&#x7684;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x88AB;&#x8BF8;&#x5982;&#x94F6;&#x884C;&#x3001;&#x7535;&#x4FE1;&#x3001;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#x7B49;&#x6570;&#x636E;&#x91CF;&#x5927;&#x7684;&#x884C;&#x4E1A;&#x91CD;&#x89C6;&#xFF0C;&#x53EF;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x88AB;&#x653E;&#x5728;&#x4E86;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x8001;&#x677F;&#x7684;&#x8BAE;&#x4E8B;&#x65E5;&#x7A0B;&#x7684;&#x91CD;&#x8981;&#x4F4D;&#x7F6E;&#x3002;</li>
</ol>

    </div>
    <div class="ui-toc dropup unselectable hidden-print" style="display:none;">
        <div class="pull-right dropdown">
            <a id="tocLabel" class="ui-toc-label btn btn-default" data-toggle="dropdown" href="#" role="button" aria-haspopup="true" aria-expanded="false" title="Table of content">
                <i class="fa fa-bars"></i>
            </a>
            <ul id="ui-toc" class="ui-toc-dropdown dropdown-menu" aria-labelledby="tocLabel">
                
            </ul>
        </div>
    </div>
    <div id="ui-toc-affix" class="ui-affix-toc ui-toc-dropdown unselectable hidden-print" data-spy="affix" style="top:17px;display:none;">
        
    </div>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.1.1/jquery.min.js" integrity="sha256-hVVnYaiADRTO2PzUGmuLJr8BLUSjGIZsDYGmIJLv2b8=" crossorigin="anonymous"></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha256-U5ZEeKfGNOja007MMD3YBI0A3OSZOQbeG6z2f2Y0hu8=" crossorigin="anonymous" defer></script>
      
    <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.2/MathJax.js?config=TeX-MML-AM_CHTML"></script>
    </body></html>